# прога, що виводить кількість кожного символа з введеної строки,
# наприклад:
st = 'as 23 fdfdg544'
# введена строка
# #
# # 'a' -> 1  #вивело в консолі
# # 's' -> 1
# # ' ' -> 2
# # '2' -> 1
# # '3' -> 1
# # 'f' -> 2
# # 'd' -> 2
# # 'g' -> 1
# # '5' -> 1
# # '4' -> 2
# # """
#
for i in set(st):
    print(f'{i} -> {st.count(i)}')

# list comprehension
#
# 1)  есть лист:
# numbers = [1, 2, 3, 4, 5, 6, 7, 8]
# создать новый лист и записать в него 'GT' если элемент в numbers больше 4 и 'LT' если элемент меньше или равен 4
# пример:
# ['LT', 'LT', 'LT', 'LT', 'GT', 'GT', 'GT', 'GT']
#
numbers = [1, 4, 5, 7, 234, 6, 7, 2, 5, 7, 9]
new_list = ['GT' if i <= 4 else 'LT' for i in numbers]

print(new_list)
# 2) есть два листа:
list1 = [1, 2, 3, 4, 5]
list2 = [-1, 7, 10, -5, -2]

# записать в лист тюплы (x,y) если x+y == 0
# пример:
# [(1, -1), (2, -2), (5, -5)]

new_list = [(x, y) for x in list1 for y in list2 if x + y == 0]
print(new_list)
